<template>
  <BaseReusableSwiper :options="landingSwiperConfig">
    <SwiperSlide v-for="review in reviews" :key="review.text">
      <BaseReview class="mx-auto" v-bind="review" />
    </SwiperSlide>
  </BaseReusableSwiper>
</template>

<script setup lang="ts">
import BaseReusableSwiper from "@/components/Shared/Swiper/BaseReusableSwiper.vue";
import landingSwiperConfig from "@/features/constants/variables/landingSwiperConfig";
import { SwiperSlide } from "swiper/vue";
import BaseReview from "@/components/Home/Reviews/BaseReview.vue";

interface TReview {
  text: string;
  authorPhoto: string;
  authorName: string;
  reviewDate: string;
}

const reviews: TReview[] = [
  {
    text: "Наше дело не так однозначно, как может показаться: высококачественный прототип будущего проекта, в своём классическом представлении, допускает внедрение новых предложений. Наше дело не так однозначно, как может показаться: высококачественный прототип будущего проекта, в своём классическом представлении, допускает внедрение новых предложений. ",
    authorName: "Marvin McKinney",
    authorPhoto: "/img/author.png",
    reviewDate: "14 сентября 2022 г.",
  },
  {
    text: "Наше дело не так однозначно, как может показаться: высококачественный прототип будущего проекта, в своём классическом представлении, допускает внедрение новых предложений. Наше дело не так однозначно, как может показаться: ",
    authorName: "Marvin McKinney",
    authorPhoto: "/img/author.png",
    reviewDate: "14 сентября 2022 г.",
  },
  {
    text: "Наше дело не так однозначно, как может показаться: высококачественный прототип будущего проекта, в своём классическом представлении, допускает внедрение новых предложений. Наше дело не так однозначно, как может показаться: высококачественный прототип будущего проекта, в своём ",
    authorName: "Marvin McKinney",
    authorPhoto: "/img/author.png",
    reviewDate: "14 сентября 2022 г.",
  },
  {
    text: "Наше дело не так однозначно, как может показаться: высококачественный прототип будущего проекта, в своём классическом представлении, допускает внедрение новых предложений. Наше дело не так однозначно, как может показаться: высококачественный прототип будущего проекта, в своём классическом представлении, допускает внедрение новых предложений. ",
    authorName: "Marvin McKinney",
    authorPhoto: "/img/author.png",
    reviewDate: "14 сентября 2022 г.",
  },
  {
    text: "Наше дело не так однозначно, как может показаться: высококачественный прототип будущего проекта, в своём классическом представлении, допускает внедрение новых предложений. Наше дело не так однозначно, как может показаться: высококачественный прототип будущего проекта, в своём классическом представлении, допускает внедрение новых предложений. ",
    authorName: "Marvin McKinney",
    authorPhoto: "/img/author.png",
    reviewDate: "14 сентября 2022 г.",
  },
  {
    text: "Наше дело не так однозначно, как может показаться: высококачественный прототип будущего проекта, в своём классическом представлении, допускает внедрение новых предложений. Наше дело не так однозначно, как может показаться: ",
    authorName: "Marvin McKinney",
    authorPhoto: "/img/author.png",
    reviewDate: "14 сентября 2022 г.",
  },
  {
    text: "Наше дело не так однозначно, как может показаться: высококачественный прототип будущего проекта, в своём классическом представлении, допускает внедрение новых предложений. Наше дело не так однозначно, как может показаться: высококачественный прототип будущего проекта, в своём ",
    authorName: "Marvin McKinney",
    authorPhoto: "/img/author.png",
    reviewDate: "14 сентября 2022 г.",
  },
  {
    text: "Наше дело не так однозначно, как может показаться: высококачественный прототип будущего проекта, в своём классическом представлении, допускает внедрение новых предложений. Наше дело не так однозначно, как может показаться: высококачественный прототип будущего проекта, в своём классическом представлении, допускает внедрение новых предложений. ",
    authorName: "Marvin McKinney",
    authorPhoto: "/img/author.png",
    reviewDate: "14 сентября 2022 г.",
  },
];
</script>

<style scoped lang="scss"></style>
